-------------------------------------------------------------------------------
      name:  reffadjust4nlcom
       log:  /Users/tom/Documents/GitHub/reffadjust/cscripts/reffadjust4nlcom.l
> og
  log type:  text
 opened on:   5 Apr 2025, 06:03:32

. * 2023-01-25 Examples from reffadjust4nlcom helpfile
. 
. cscript reffadjust4nlcom adofiles reffadjust4nlcom
---------------------------------------------------------BEGIN reffadjust4nlcom

-> which reffadjust4nlcom, usesysdir
/Users/tom/Documents/GitHub/reffadjust/reffadjust4nlcom.ado
*! version 1.1.0 2sep2013 Tom Palmer & Corrie Macdonald-Wallis

. 
. about

StataNow/MP 18.5 for Unix (Apple Silicon)
Revision 26 Feb 2025
Copyright 1985-2023 StataCorp LLC

Total usable memory: 16.00 GB

Stata license: Unlimited-user 2-core network, expiring 29 Jan 2026
Serial number: 501809305331
  Licensed to: Tom Palmer
               University of Bristol

. 
. // Examples 1 & 2 assume the path to the MLwiN executable is set in global ML
> wiN_path; see runmlwin
. 
. if c(os) == "Windows" global MLwiN_path "C:\\Program Files\\MLwiN v3.13\\mlwi
> n.exe"

. if c(machine_type) == "Mac (Apple Silicon)" global MLwiN_path "/opt/mln/mlnsc
> ript"

. 
. // Example 1: Two level continuous response model (see page 59 of the MLwiN U
> ser Manual)
. * read in data
. use https://www.bristol.ac.uk/cmm/media/runmlwin/tutorial, clear

. 
. * fit model using MLwiN via runmlwin
. runmlwin normexam cons standlrt, level1(student: cons) level2(school: cons st
> andlrt) batch
 
 --- Begin MLwiN error log --- 
MLN - Software for N-level analysis.   Sat 05 Apr 2025 05:03:32.292480

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000002

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000006
 --- End MLwiN error log --- 

Warning: getversion plugin could not be loaded
MLwiN 3.13 multilevel model                     Number of obs      =      4059
Normal response model (hierarchical)
Estimation algorithm: IGLS

-----------------------------------------------------------
                |   No. of       Observations per Group
 Level Variable |   Groups    Minimum    Average    Maximum
----------------+------------------------------------------
         school |       65          2       62.4        198
-----------------------------------------------------------

Run time (seconds)   =       0.05
Number of iterations =          4
Log likelihood       =  -4658.435
Deviance             =    9316.87
------------------------------------------------------------------------------
    normexam |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        cons |  -.0115051    .039783   -0.29    0.772    -.0894783     .066468
    standlrt |   .5567305    .019937   27.92    0.000     .5176547    .5958062
------------------------------------------------------------------------------

------------------------------------------------------------------------------
   Random-effects Parameters |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
Level 2: school              |
                   var(cons) |   .0904446    .017924      .0553142    .1255749
          cov(cons,standlrt) |   .0180414   .0067229      .0048649     .031218
               var(standlrt) |   .0145361   .0044139      .0058851    .0231872
-----------------------------+------------------------------------------------
Level 1: student             |
                   var(cons) |   .5536575   .0124818      .5291937    .5781214
------------------------------------------------------------------------------

. 
. * report coefficient and delta-method confidence interval
. reffadjust4nlcom cons standlrt, eqn(RP2)

. nlcom `r(beta_standlrt)'

       _nl_1: [RP2]cov(cons\standlrt)/[RP2]var(standlrt)

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   1.241144   .4275471     2.90   0.004     .4031675    2.079121
------------------------------------------------------------------------------

. 
. * compare reporting coefficient as median with 2.5 & 97.5 percentiles
. // reffadjustsim cons standlrt, eqn(RP2) seed(12345)
. 
. * compare reporting coefficient as mean & Wald-type confidence interval
. * Warning: mean and Wald-type confidence are inaccurate in this example
. // reffadjustsim cons standlrt, eqn(RP2) seed(12345) waldtype
. 
. * to view just the coefficient or string expression for the coefficient
. reffadjust4nlcom cons standlrt, eqn(RP2)

. display `r(beta_standlrt)'
1.2411444

. mata st_macroexpand("`r(beta_standlrt)'")
  [RP2]cov(cons\standlrt)/[RP2]var(standlrt)

. 
. * compare with Bayesian posterior distribution
. sort school student

. runmlwin normexam cons standlrt, level1(student: cons) ///
>     level2(school: cons standlrt) batch mcmc(on) initsprevious ///
>     seed(121211)
 
 --- Begin MLwiN error log --- 
MLN - Software for N-level analysis.   Sat 05 Apr 2025 05:03:32.377940

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000003

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000007

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000001
 --- End MLwiN error log --- 

Warning: getversion plugin could not be loaded
MLwiN 3.13 multilevel model                     Number of obs      =      4059
Normal response model (hierarchical)
Estimation algorithm: MCMC

-----------------------------------------------------------
                |   No. of       Observations per Group
 Level Variable |   Groups    Minimum    Average    Maximum
----------------+------------------------------------------
         school |       65          2       62.4        198
-----------------------------------------------------------

Burnin                     =        500
Chain                      =       5000
Thinning                   =          1
Run time (seconds)         =       .608
Deviance (dbar)            =    9122.42
Deviance (thetabar)        =    9031.09
Effective no. of pars (pd) =      91.34
Bayesian DIC               =    9213.76
------------------------------------------------------------------------------
    normexam |      Mean    Std. Dev.     ESS     P       [95% Cred. Interval]
-------------+----------------------------------------------------------------
        cons |   -.010594    .040224      189   0.395    -.0908355    .0678323
    standlrt |   .5568075   .0200344      839   0.000     .5167302    .5960792
------------------------------------------------------------------------------

------------------------------------------------------------------------------
   Random-effects Parameters |     Mean   Std. Dev.   ESS     [95% Cred. Int]
-----------------------------+------------------------------------------------
Level 2: school              |
                   var(cons) |  .0961163  .0199991   2715   .0644542  .1421674
          cov(cons,standlrt) |  .0190683  .0072205   1713   .0065699   .034989
               var(standlrt) |  .0153485  .0046893    978   .0078805  .0261361
-----------------------------+------------------------------------------------
Level 1: student             |
                   var(cons) |  .5542075  .0123209   4645   .5309043   .578929
------------------------------------------------------------------------------

. mcmcsum, getchains

. reffadjust4nlcom cons standlrt, eqn(RP2) mcmcsum

. gen beta_standlrt = `r(beta_standlrt)'

. mcmcsum beta_standlrt, variables
------------------------------------------------------------------------------
             |      Mean    Std. Dev.     ESS     P       [95% Cred. Interval]
-------------+----------------------------------------------------------------
beta_standlrt|   1.289067    .456183      857   0.001     .4577979       2.279
------------------------------------------------------------------------------

. 
. // Example 2: Multivariate response model (see page 214 of the MLwiN User Man
> ual)
. * read in data
. use https://www.bristol.ac.uk/cmm/media/runmlwin/gcsemv1, clear

. 
. * fit model using MLwiN via runmlwin
. runmlwin (written cons female, eq(1)) ///
>     (csework cons female, eq(2)), ///
>     level1(student: (cons, eq(1)) (cons, eq(2))) level2(school: (cons, eq(1))
>  (cons, eq(2))) batch
 
 --- Begin MLwiN error log --- 
MLN - Software for N-level analysis.   Sat 05 Apr 2025 05:03:33.127439

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000002

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000006

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000007
 --- End MLwiN error log --- 

Warning: getversion plugin could not be loaded
MLwiN 3.13 multilevel model                     Number of obs      =      1905
Multivariate response model (hierarchical)
Estimation algorithm: IGLS

-----------------------------------------------------------
                |   No. of       Observations per Group
 Level Variable |   Groups    Minimum    Average    Maximum
----------------+------------------------------------------
         school |       73          2       26.1        104
-----------------------------------------------------------

Run time (seconds)   =       0.10
Number of iterations =          4
Log likelihood       = -13400.244
Deviance             =  26800.488
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
written      |
      cons_1 |   49.45213   .9338433   52.96    0.000     47.62183    51.28243
    female_1 |   -2.50295   .5607219   -4.46    0.000    -3.601945   -1.403955
-------------+----------------------------------------------------------------
csework      |
      cons_2 |   69.67166   1.171786   59.46    0.000       67.375    71.96831
    female_2 |   6.751393   .6706493   10.07    0.000     5.436944    8.065841
------------------------------------------------------------------------------

------------------------------------------------------------------------------
   Random-effects Parameters |   Estimate   Std. Err.     [95% Conf. Interval]
-----------------------------+------------------------------------------------
Level 2: school              |
                 var(cons_1) |   46.81298    9.18733      28.80615    64.81982
          cov(cons_1,cons_2) |   24.87783   8.880358       7.47265    42.28301
                 var(cons_2) |   75.16623   14.56485      46.61965    103.7128
-----------------------------+------------------------------------------------
Level 1: student             |
                 var(cons_1) |   124.6343   4.349834      116.1088    133.1598
          cov(cons_1,cons_2) |   73.00323    4.17829      64.81393    81.19252
                 var(cons_2) |   180.0982   6.245801      167.8566    192.3397
------------------------------------------------------------------------------

. 
. * report coefficient and delta-method confidence interval
. reffadjust4nlcom cons_1 cons_2, eqn(RP2)

. nlcom `r(beta_cons_2)'

       _nl_1: [RP2]cov(cons_1\cons_2)/[RP2]var(cons_2)

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .3309709   .0986417     3.36   0.001     .1376367    .5243051
------------------------------------------------------------------------------

. 
. * compare reporting coefficient as median with 2.5 and 97.5 percentiles
. // reffadjustsim cons_1 cons_2, eqn(RP2) seed(12345)
. 
. * compare reporting coefficient as mean with Wald-type confidence interval
. // reffadjustsim cons_1 cons_2, eqn(RP2) seed(12345) waldtype
. 
. * to view just the coefficient or string expression for the coefficient
. reffadjust4nlcom cons_1 cons_2, eqn(RP2)

. display `r(beta_cons_2)'
.33097086

. mata st_macroexpand("`r(beta_cons_2)'")
  [RP2]cov(cons_1\cons_2)/[RP2]var(cons_2)

. 
. * compare with Bayesian posterior distribution
. sort school student

. runmlwin (written cons female, eq(1)) (csework cons female, eq(2)), ///
>     level1(student: (cons, eq(1)) (cons, eq(2))) ///
>     level2(school: (cons, eq(1)) (cons, eq(2))) batch mcmc(on) initsprevious 
> seed(121211)
 
 --- Begin MLwiN error log --- 
MLN - Software for N-level analysis.   Sat 05 Apr 2025 05:03:33.248669

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000003

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000007

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000008

/var/folders/1l/w0qjrymd3hb44s3skrzn4w4w0000gn/T//St50406.000001
 --- End MLwiN error log --- 

Warning: getversion plugin could not be loaded
MLwiN 3.13 multilevel model                     Number of obs      =      1905
Multivariate response model (hierarchical)
Estimation algorithm: MCMC

-----------------------------------------------------------
                |   No. of       Observations per Group
 Level Variable |   Groups    Minimum    Average    Maximum
----------------+------------------------------------------
         school |       73          2       26.1        104
-----------------------------------------------------------

Burnin                     =        500
Chain                      =       5000
Thinning                   =          1
Run time (seconds)         =       1.05
Deviance (dbar)            =   29388.29
Deviance (thetabar)        =   28877.57
Effective no. of pars (pd) =     510.73
Bayesian DIC               =   29899.02
------------------------------------------------------------------------------
             |      Mean    Std. Dev.     ESS     P       [95% Cred. Interval]
-------------+----------------------------------------------------------------
written      |
      cons_1 |   49.50607   .9899419      242   0.000     47.57032    51.46915
    female_1 |  -2.492796   .5577673     3451   0.000    -3.593134   -1.390972
-------------+----------------------------------------------------------------
csework      |
      cons_2 |    69.6792   1.232286      222   0.000     67.27528    72.03018
    female_2 |   6.761519     .67411     3672   0.000     5.458935    8.089689
------------------------------------------------------------------------------

------------------------------------------------------------------------------
   Random-effects Parameters |     Mean   Std. Dev.   ESS     [95% Cred. Int]
-----------------------------+------------------------------------------------
Level 2: school              |
                 var(cons_1) |  50.08992   10.5095   2376   32.88132  73.71481
          cov(cons_1,cons_2) |  26.20564  9.578987   2490   9.893032  46.83127
                 var(cons_2) |  78.90363  15.49003   2637   53.52962  112.7813
-----------------------------+------------------------------------------------
Level 1: student             |
                 var(cons_1) |  124.8802  4.356383   3734   116.8696  133.6906
          cov(cons_1,cons_2) |    73.189  4.186575   3819   65.23343  81.54988
                 var(cons_2) |   180.573   6.35916   4068   168.6235  193.2279
------------------------------------------------------------------------------

. mcmcsum, getchains

. reffadjust4nlcom cons_1 cons_2, eqn(RP2) mcmcsum

. gen beta_cons_2 = `r(beta_cons_2)'

. mcmcsum beta_cons_2, variables
------------------------------------------------------------------------------
             |      Mean    Std. Dev.     ESS     P       [95% Cred. Interval]
-------------+----------------------------------------------------------------
 beta_cons_2 |   .3318915   .1002958     2477   0.000     .1324359    .5296823
------------------------------------------------------------------------------

. 
. // Example 3: based on xtmixed helpfile
. webuse nlswork, clear
(National Longitudinal Survey of Young Women, 14-24 years old in 1968)

. version 12: xtmixed ln_w grade age c.age#c.age ttl_exp tenure c.tenure#c.tenu
> re || idcode: tenure, cov(uns) var

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -8985.3816  
Iteration 1:  Log likelihood = -8966.3054  
Iteration 2:  Log likelihood =  -8965.819  
Iteration 3:  Log likelihood =  -8965.819  

Computing standard errors:

Mixed-effects ML regression                         Number of obs    =  28,099
Group variable: idcode                              Number of groups =   4,697
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     6.0
                                                                 max =      15
                                                    Wald chi2(6)     = 6767.13
Log likelihood =  -8965.819                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |   .0690318   .0017885    38.60   0.000     .0655264    .0725372
         age |   .0321872   .0027908    11.53   0.000     .0267174     .037657
             |
 c.age#c.age |  -.0006574   .0000466   -14.09   0.000    -.0007488    -.000566
             |
     ttl_exp |   .0350762   .0011352    30.90   0.000     .0328513     .037301
      tenure |   .0393576   .0017198    22.88   0.000     .0359868    .0427284
             |
    c.tenure#|
    c.tenure |  -.0019926   .0001232   -16.18   0.000    -.0022341   -.0017512
             |
       _cons |    .162264    .044888     3.61   0.000     .0742851    .2502429
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0005174   .0000566      .0004176    .0006411
                  var(_cons) |   .0632497   .0020808      .0593001    .0674624
           cov(tenure,_cons) |   .0007165   .0002809      .0001658    .0012671
-----------------------------+------------------------------------------------
               var(Residual) |   .0815016   .0007978      .0799529    .0830803
------------------------------------------------------------------------------
LR test vs. linear model: chi2(3) = 9168.36               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. version 12: reffadjust4nlcom _cons tenure, eqn(idcode)

. nlcom `r(beta_tenure)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   1.384766   .6149301     2.25   0.024     .1795251    2.590007
------------------------------------------------------------------------------

. version 13: mixed ln_w grade age c.age#c.age ttl_exp tenure c.tenure#c.tenure
>  || idcode: tenure, cov(uns)

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -8985.3816  
Iteration 1:  Log likelihood = -8966.3054  
Iteration 2:  Log likelihood =  -8965.819  
Iteration 3:  Log likelihood =  -8965.819  

Computing standard errors:

Mixed-effects ML regression                         Number of obs    =  28,099
Group variable: idcode                              Number of groups =   4,697
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     6.0
                                                                 max =      15
                                                    Wald chi2(6)     = 6767.13
Log likelihood =  -8965.819                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |   .0690318   .0017885    38.60   0.000     .0655264    .0725372
         age |   .0321872   .0027908    11.53   0.000     .0267174     .037657
             |
 c.age#c.age |  -.0006574   .0000466   -14.09   0.000    -.0007488    -.000566
             |
     ttl_exp |   .0350762   .0011352    30.90   0.000     .0328513     .037301
      tenure |   .0393576   .0017198    22.88   0.000     .0359868    .0427284
             |
    c.tenure#|
    c.tenure |  -.0019926   .0001232   -16.18   0.000    -.0022341   -.0017512
             |
       _cons |    .162264    .044888     3.61   0.000     .0742851    .2502429
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0005174   .0000566      .0004176    .0006411
                  var(_cons) |   .0632497   .0020808      .0593001    .0674624
           cov(tenure,_cons) |   .0007165   .0002809      .0001658    .0012671
-----------------------------+------------------------------------------------
               var(Residual) |   .0815016   .0007978      .0799529    .0830803
------------------------------------------------------------------------------
LR test vs. linear model: chi2(3) = 9168.36               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons tenure, eqn(idcode)

. nlcom `r(beta_tenure)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   1.384766   .6149301     2.25   0.024     .1795251    2.590007
------------------------------------------------------------------------------

. mixed ln_w grade age c.age#c.age ttl_exp tenure c.tenure#c.tenure || idcode: 
> tenure, cov(uns)

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -8985.3816  
Iteration 1:  Log likelihood = -8966.3858  
Iteration 2:  Log likelihood =  -8965.819  
Iteration 3:  Log likelihood =  -8965.819  

Computing standard errors ...

Mixed-effects ML regression                         Number of obs    =  28,099
Group variable: idcode                              Number of groups =   4,697
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     6.0
                                                                 max =      15
                                                    Wald chi2(6)     = 6767.13
Log likelihood =  -8965.819                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |   .0690318   .0017885    38.60   0.000     .0655264    .0725372
         age |   .0321872   .0027908    11.53   0.000     .0267174     .037657
             |
 c.age#c.age |  -.0006574   .0000466   -14.09   0.000    -.0007488    -.000566
             |
     ttl_exp |   .0350762   .0011352    30.90   0.000     .0328513     .037301
      tenure |   .0393576   .0017198    22.88   0.000     .0359868    .0427284
             |
    c.tenure#|
    c.tenure |  -.0019926   .0001232   -16.18   0.000    -.0022341   -.0017512
             |
       _cons |    .162264    .044888     3.61   0.000     .0742851    .2502429
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0005174   .0000566      .0004176    .0006411
                  var(_cons) |   .0632497   .0020808      .0593001    .0674625
           cov(tenure,_cons) |   .0007165   .0002809      .0001658    .0012671
-----------------------------+------------------------------------------------
               var(Residual) |   .0815016   .0007978      .0799529    .0830803
------------------------------------------------------------------------------
LR test vs. linear model: chi2(3) = 9168.36               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons tenure, eqn(idcode)

. nlcom `r(beta_tenure)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   1.384765   .6149303     2.25   0.024     .1795242    2.590007
------------------------------------------------------------------------------

. 
. // Example 4: based on xtmelogit helpfile
. webuse bangladesh, clear
(Bangladesh Fertility Survey, 1989)

. version 12: xtmelogit c_use urban age child? || district: urban, cov(uns) var

Refining starting values: 

Iteration 0:  Log likelihood = -1215.8594  (not concave)
Iteration 1:  Log likelihood = -1204.0802  
Iteration 2:  Log likelihood = -1199.7991  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -1199.7991  
Iteration 1:  Log likelihood = -1199.4804  
Iteration 2:  Log likelihood = -1199.3158  
Iteration 3:  Log likelihood =  -1199.315  
Iteration 4:  Log likelihood =  -1199.315  

Mixed-effects logistic regression               Number of obs     =      1,934
Group variable: district                        Number of groups  =         60

                                                Obs per group:
                                                              min =          2
                                                              avg =       32.2
                                                              max =        118

Integration points =   7                        Wald chi2(5)      =      97.50
Log likelihood =  -1199.315                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       urban |   .8157872    .171552     4.76   0.000     .4795516    1.152023
         age |   -.026415    .008023    -3.29   0.001    -.0421398   -.0106902
      child1 |    1.13252   .1603285     7.06   0.000     .8182819    1.446758
      child2 |   1.357739   .1770522     7.67   0.000     1.010724    1.704755
      child3 |   1.353827   .1828801     7.40   0.000     .9953881    1.712265
       _cons |   -1.71165   .1605617   -10.66   0.000    -2.026345   -1.396954
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
district: Unstructured       |
                  var(urban) |   .6663223   .3224716      .2580709    1.720401
                  var(_cons) |   .3897434   .1292459      .2034722    .7465388
            cov(urban,_cons) |  -.4058846   .1755418     -.7499403   -.0618289
------------------------------------------------------------------------------
LR test vs. logistic model: chi2(3) = 58.42               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. version 12: reffadjust4nlcom _cons urban, eqn(district)

. nlcom `r(beta_urban)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.6091416   .1605193    -3.79   0.000    -.9237536   -.2945295
------------------------------------------------------------------------------

. version 13: meqrlogit c_use urban age child? || district: urban, cov(uns)

Refining starting values: 

Iteration 0:  Log likelihood = -1215.8594  (not concave)
Iteration 1:  Log likelihood = -1204.0802  
Iteration 2:  Log likelihood = -1199.7991  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -1199.7991  
Iteration 1:  Log likelihood = -1199.4804  
Iteration 2:  Log likelihood = -1199.3158  
Iteration 3:  Log likelihood =  -1199.315  
Iteration 4:  Log likelihood =  -1199.315  

Mixed-effects logistic regression               Number of obs     =      1,934
Group variable: district                        Number of groups  =         60

                                                Obs per group:
                                                              min =          2
                                                              avg =       32.2
                                                              max =        118

Integration points =   7                        Wald chi2(5)      =      97.50
Log likelihood =  -1199.315                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       urban |   .8157872    .171552     4.76   0.000     .4795516    1.152023
         age |   -.026415    .008023    -3.29   0.001    -.0421398   -.0106902
      child1 |    1.13252   .1603285     7.06   0.000     .8182819    1.446758
      child2 |   1.357739   .1770522     7.67   0.000     1.010724    1.704755
      child3 |   1.353827   .1828801     7.40   0.000     .9953881    1.712265
       _cons |   -1.71165   .1605617   -10.66   0.000    -2.026345   -1.396954
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
district: Unstructured       |
                  var(urban) |   .6663223   .3224716      .2580709    1.720401
                  var(_cons) |   .3897434   .1292459      .2034722    .7465388
            cov(urban,_cons) |  -.4058846   .1755418     -.7499403   -.0618289
------------------------------------------------------------------------------
LR test vs. logistic model: chi2(3) = 58.42               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons urban, eqn(district)

. nlcom `r(beta_urban)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.6091416   .1605193    -3.79   0.000    -.9237536   -.2945295
------------------------------------------------------------------------------

. meqrlogit c_use urban age child? || district: urban, cov(uns)

Refining starting values: 

Iteration 0:  Log likelihood = -1215.8594  (not concave)
Iteration 1:  Log likelihood = -1204.0802  
Iteration 2:  Log likelihood = -1199.7991  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -1199.7991  
Iteration 1:  Log likelihood = -1199.4804  
Iteration 2:  Log likelihood = -1199.3158  
Iteration 3:  Log likelihood =  -1199.315  
Iteration 4:  Log likelihood =  -1199.315  

Mixed-effects logistic regression               Number of obs     =      1,934
Group variable: district                        Number of groups  =         60

                                                Obs per group:
                                                              min =          2
                                                              avg =       32.2
                                                              max =        118

Integration points =   7                        Wald chi2(5)      =      97.50
Log likelihood =  -1199.315                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       urban |   .8157872    .171552     4.76   0.000     .4795516    1.152023
         age |   -.026415    .008023    -3.29   0.001    -.0421398   -.0106902
      child1 |    1.13252   .1603285     7.06   0.000     .8182819    1.446758
      child2 |   1.357739   .1770522     7.67   0.000     1.010724    1.704755
      child3 |   1.353827   .1828801     7.40   0.000     .9953881    1.712265
       _cons |   -1.71165   .1605617   -10.66   0.000    -2.026345   -1.396954
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
district: Unstructured       |
                  var(urban) |   .6663223   .3224716      .2580709    1.720401
                  var(_cons) |   .3897434   .1292459      .2034722    .7465388
            cov(urban,_cons) |  -.4058846   .1755418     -.7499403   -.0618289
------------------------------------------------------------------------------
LR test vs. logistic model: chi2(3) = 58.42               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons urban, eqn(district)

. nlcom `r(beta_urban)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
       c_use | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.6091416   .1605193    -3.79   0.000    -.9237536   -.2945295
------------------------------------------------------------------------------

. 
. // Example 5: based on xtmepoisson helpfile
. webuse epilepsy, clear
(Epilepsy data; progabide drug treatment)

. version 12: xtmepoisson seizures treat lbas lbas_trt lage visit || subject: v
> isit, cov(uns) var intpoints(9)

Refining starting values: 

Iteration 0:  Log likelihood = -672.17188  (not concave)
Iteration 1:  Log likelihood = -660.46056  
Iteration 2:  Log likelihood = -655.86903  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -655.86903  
Iteration 1:  Log likelihood = -655.68216  
Iteration 2:  Log likelihood = -655.68103  
Iteration 3:  Log likelihood = -655.68103  

Mixed-effects Poisson regression                Number of obs     =        236
Group variable: subject                         Number of groups  =         59

                                                Obs per group:
                                                              min =          4
                                                              avg =        4.0
                                                              max =          4

Integration points =   9                        Wald chi2(5)      =     115.56
Log likelihood = -655.68103                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |  -.9286589   .4021642    -2.31   0.021    -1.716886   -.1404316
        lbas |   .8849766    .131252     6.74   0.000     .6277275    1.142226
    lbas_trt |   .3379758   .2044444     1.65   0.098    -.0627279    .7386794
        lage |   .4767192    .353622     1.35   0.178    -.2163673    1.169806
       visit |  -.2664098   .1647096    -1.62   0.106    -.5892347    .0564151
       _cons |   2.099555   .2203711     9.53   0.000     1.667635    2.531474
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
subject: Unstructured        |
                  var(visit) |   .5314808   .2293851      .2280931    1.238406
                  var(_cons) |   .2514928   .0587892      .1590552    .3976522
            cov(visit,_cons) |   .0028715   .0887018     -.1709808    .1767238
------------------------------------------------------------------------------
LR test vs. Poisson model: chi2(3) = 324.54               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. version 12: reffadjust4nlcom _cons visit, eqn(subject)

. nlcom `r(beta_visit)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0054029   .1669653     0.03   0.974    -.3218432    .3326489
------------------------------------------------------------------------------

. version 13: meqrpoisson seizures treat lbas lbas_trt lage visit || subject: v
> isit, cov(uns) intpoints(9)

Refining starting values: 

Iteration 0:  Log likelihood = -672.17188  (not concave)
Iteration 1:  Log likelihood = -660.46056  
Iteration 2:  Log likelihood = -655.86903  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -655.86903  
Iteration 1:  Log likelihood = -655.68216  
Iteration 2:  Log likelihood = -655.68103  
Iteration 3:  Log likelihood = -655.68103  

Mixed-effects Poisson regression                Number of obs     =        236
Group variable: subject                         Number of groups  =         59

                                                Obs per group:
                                                              min =          4
                                                              avg =        4.0
                                                              max =          4

Integration points =   9                        Wald chi2(5)      =     115.56
Log likelihood = -655.68103                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |  -.9286589   .4021642    -2.31   0.021    -1.716886   -.1404316
        lbas |   .8849766    .131252     6.74   0.000     .6277275    1.142226
    lbas_trt |   .3379758   .2044444     1.65   0.098    -.0627279    .7386794
        lage |   .4767192    .353622     1.35   0.178    -.2163673    1.169806
       visit |  -.2664098   .1647096    -1.62   0.106    -.5892347    .0564151
       _cons |   2.099555   .2203711     9.53   0.000     1.667635    2.531474
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
subject: Unstructured        |
                  var(visit) |   .5314808   .2293851      .2280931    1.238406
                  var(_cons) |   .2514928   .0587892      .1590552    .3976522
            cov(visit,_cons) |   .0028715   .0887018     -.1709808    .1767238
------------------------------------------------------------------------------
LR test vs. Poisson model: chi2(3) = 324.54               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons visit, eqn(subject)

. nlcom `r(beta_visit)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0054029   .1669653     0.03   0.974    -.3218432    .3326489
------------------------------------------------------------------------------

. meqrpoisson seizures treat lbas lbas_trt lage visit || subject: visit, cov(un
> s) intpoints(9)

Refining starting values: 

Iteration 0:  Log likelihood = -672.17188  (not concave)
Iteration 1:  Log likelihood = -660.46056  
Iteration 2:  Log likelihood = -655.86903  

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -655.86903  
Iteration 1:  Log likelihood = -655.68216  
Iteration 2:  Log likelihood = -655.68103  
Iteration 3:  Log likelihood = -655.68103  

Mixed-effects Poisson regression                Number of obs     =        236
Group variable: subject                         Number of groups  =         59

                                                Obs per group:
                                                              min =          4
                                                              avg =        4.0
                                                              max =          4

Integration points =   9                        Wald chi2(5)      =     115.56
Log likelihood = -655.68103                     Prob > chi2       =     0.0000

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |  -.9286589   .4021642    -2.31   0.021    -1.716886   -.1404316
        lbas |   .8849766    .131252     6.74   0.000     .6277275    1.142226
    lbas_trt |   .3379758   .2044444     1.65   0.098    -.0627279    .7386794
        lage |   .4767192    .353622     1.35   0.178    -.2163673    1.169806
       visit |  -.2664098   .1647096    -1.62   0.106    -.5892347    .0564151
       _cons |   2.099555   .2203711     9.53   0.000     1.667635    2.531474
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
subject: Unstructured        |
                  var(visit) |   .5314808   .2293851      .2280931    1.238406
                  var(_cons) |   .2514928   .0587892      .1590552    .3976522
            cov(visit,_cons) |   .0028715   .0887018     -.1709808    .1767238
------------------------------------------------------------------------------
LR test vs. Poisson model: chi2(3) = 324.54               Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom _cons visit, eqn(subject)

. nlcom `r(beta_visit)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_1]_cons)

------------------------------------------------------------------------------
    seizures | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0054029   .1669653     0.03   0.974    -.3218432    .3326489
------------------------------------------------------------------------------

. 
. // Example 6: repeated group variable
. webuse nlswork, clear
(National Longitudinal Survey of Young Women, 14-24 years old in 1968)

. version 12: xtmixed ln_w grade age || idcode: tenure union, cov(uns) || idcod
> e: race, cov(uns) var

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -5208.9293  
Iteration 1:  Log likelihood = -5196.1179  (not concave)
Iteration 2:  Log likelihood = -5176.3192  
Iteration 3:  Log likelihood = -5171.5874  
Iteration 4:  Log likelihood = -5171.0757  
Iteration 5:  Log likelihood = -5171.0495  
Iteration 6:  Log likelihood = -5171.0492  

Computing standard errors:

Mixed-effects ML regression                         Number of obs    =  19,008
Group variable: idcode                              Number of groups =   4,132
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     4.6
                                                                 max =      12
                                                    Wald chi2(2)     = 2164.18
Log likelihood = -5171.0492                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |    .083625   .0022067    37.90   0.000        .0793      .08795
         age |   .0104518   .0004215    24.80   0.000     .0096256    .0112779
       _cons |   .2739857   .0306868     8.93   0.000     .2138407    .3341307
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0007758   .0000666      .0006556    .0009181
                  var(union) |   .0514475   .0041886      .0438595    .0603483
           cov(tenure,union) |   .0016667   .0004909      .0007044    .0026289
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                   var(race) |   .0202236    .013914      .0052508    .0778915
                  var(_cons) |   .1578102   .0312782      .1070104    .2327257
             cov(race,_cons) |  -.0401892   .0220462      -.083399    .0030206
-----------------------------+------------------------------------------------
               var(Residual) |   .0583641   .0007602      .0568929    .0598732
------------------------------------------------------------------------------
LR test vs. linear model: chi2(6) = 10154.21              Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. version 12: reffadjust4nlcom tenure union, eqn(idcode) sub(1)

. nlcom `r(beta_union)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0323954   .0101649     3.19   0.001     .0124726    .0523181
------------------------------------------------------------------------------

. version 12: reffadjust4nlcom race _cons, eqn(idcode) sub(2)

. nlcom `r(beta__cons)'

       _nl_1: tanh([atr1_2_1_2]_cons)*exp([lns1_2_1]_cons + [lns1_2_2]_cons)/ex
> p(2*[lns1_2_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.2546681   .0900624    -2.83   0.005    -.4311872   -.0781489
------------------------------------------------------------------------------

. version 13: mixed ln_w grade age || idcode: tenure union, cov(uns) || idcode:
>  race, cov(uns)

Performing EM optimization: 

Performing gradient-based optimization: 

Iteration 0:  Log likelihood = -5208.9293  
Iteration 1:  Log likelihood = -5196.1179  (not concave)
Iteration 2:  Log likelihood = -5176.3192  
Iteration 3:  Log likelihood = -5171.5874  
Iteration 4:  Log likelihood = -5171.0757  
Iteration 5:  Log likelihood = -5171.0495  
Iteration 6:  Log likelihood = -5171.0492  

Computing standard errors:

Mixed-effects ML regression                         Number of obs    =  19,008
Group variable: idcode                              Number of groups =   4,132
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     4.6
                                                                 max =      12
                                                    Wald chi2(2)     = 2164.18
Log likelihood = -5171.0492                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |    .083625   .0022067    37.90   0.000        .0793      .08795
         age |   .0104518   .0004215    24.80   0.000     .0096256    .0112779
       _cons |   .2739857   .0306868     8.93   0.000     .2138407    .3341307
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0007758   .0000666      .0006556    .0009181
                  var(union) |   .0514475   .0041886      .0438595    .0603483
           cov(tenure,union) |   .0016667   .0004909      .0007044    .0026289
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                   var(race) |   .0202236    .013914      .0052508    .0778915
                  var(_cons) |   .1578102   .0312782      .1070104    .2327257
             cov(race,_cons) |  -.0401892   .0220462      -.083399    .0030206
-----------------------------+------------------------------------------------
               var(Residual) |   .0583641   .0007602      .0568929    .0598732
------------------------------------------------------------------------------
LR test vs. linear model: chi2(6) = 10154.21              Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom tenure union, eqn(idcode) sub(1)

. nlcom `r(beta_union)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0323954   .0101649     3.19   0.001     .0124726    .0523181
------------------------------------------------------------------------------

. reffadjust4nlcom race _cons, eqn(idcode) sub(2)

. nlcom `r(beta__cons)'

       _nl_1: tanh([atr1_2_1_2]_cons)*exp([lns1_2_1]_cons + [lns1_2_2]_cons)/ex
> p(2*[lns1_2_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.2546681   .0900624    -2.83   0.005    -.4311872   -.0781489
------------------------------------------------------------------------------

. mixed ln_w grade age || idcode: tenure union, cov(uns) || idcode: race, cov(u
> ns)

Performing EM optimization ...

Performing gradient-based optimization: 
Iteration 0:  Log likelihood = -5208.9293  
Iteration 1:  Log likelihood = -5200.3367  (not concave)
Iteration 2:  Log likelihood = -5175.6347  (not concave)
Iteration 3:  Log likelihood = -5174.0452  
Iteration 4:  Log likelihood = -5173.1083  
Iteration 5:  Log likelihood = -5171.0617  
Iteration 6:  Log likelihood = -5171.0496  
Iteration 7:  Log likelihood = -5171.0492  

Computing standard errors ...

Mixed-effects ML regression                         Number of obs    =  19,008
Group variable: idcode                              Number of groups =   4,132
                                                    Obs per group:
                                                                 min =       1
                                                                 avg =     4.6
                                                                 max =      12
                                                    Wald chi2(2)     = 2164.18
Log likelihood = -5171.0492                         Prob > chi2      =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |   .0836249   .0022067    37.90   0.000     .0792999    .0879499
         age |   .0104518   .0004215    24.80   0.000     .0096256    .0112779
       _cons |   .2739862   .0306868     8.93   0.000      .213841    .3341313
------------------------------------------------------------------------------

------------------------------------------------------------------------------
  Random-effects parameters  |   Estimate   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                 var(tenure) |   .0007758   .0000666      .0006556    .0009181
                  var(union) |   .0514474   .0041886      .0438594    .0603483
           cov(tenure,union) |   .0016667   .0004909      .0007044    .0026289
-----------------------------+------------------------------------------------
idcode: Unstructured         |
                   var(race) |    .020226   .0139118      .0052534    .0778719
                  var(_cons) |   .1578136   .0312742      .1070188    .2327172
             cov(race,_cons) |  -.0401921    .022043     -.0833957    .0030114
-----------------------------+------------------------------------------------
               var(Residual) |    .058364   .0007602      .0568929    .0598732
------------------------------------------------------------------------------
LR test vs. linear model: chi2(6) = 10154.21              Prob > chi2 = 0.0000

Note: LR test is conservative and provided only for reference.

. reffadjust4nlcom tenure union, eqn(idcode) sub(1)

. nlcom `r(beta_union)'

       _nl_1: tanh([atr1_1_1_2]_cons)*exp([lns1_1_1]_cons + [lns1_1_2]_cons)/ex
> p(2*[lns1_1_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |   .0323954   .0101649     3.19   0.001     .0124726    .0523182
------------------------------------------------------------------------------

. reffadjust4nlcom race _cons, eqn(idcode) sub(2)

. nlcom `r(beta__cons)'

       _nl_1: tanh([atr1_2_1_2]_cons)*exp([lns1_2_1]_cons + [lns1_2_2]_cons)/ex
> p(2*[lns1_2_2]_cons)

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _nl_1 |  -.2546811   .0900444    -2.83   0.005    -.4311648   -.0781974
------------------------------------------------------------------------------

. 
end of do-file
      name:  reffadjust4nlcom
       log:  /Users/tom/Documents/GitHub/reffadjust/cscripts/reffadjust4nlcom.l
> og
  log type:  text
 closed on:   5 Apr 2025, 06:04:43
-------------------------------------------------------------------------------
